app/controllers/api/announcements_controller.rb

    def index
      @announcements = Announcement.all
---
SELECT "announcements".* FROM "announcements"

    def set_announcement
      @announcement = Announcement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]