app/controllers/api/employees_controller.rb

INSERT INTO "employees" ("LDAP", "name", "email", "position", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      @employee = Employee.new(employee_params)
      @employee.ldap = generate_random_ldap_entry

      if @employee.save