app/controllers/api/leave_requests_controller.rb

    def index
      @leave_requests = LeaveRequest.all
---
SELECT "leave_requests".* FROM "leave_requests"

    def set_leave_request
      @leave_request = LeaveRequest.find(params[:id])
---
SELECT "leave_requests".* FROM "leave_requests" WHERE "leave_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]