app/controllers/api/performance_evaluations_controller.rb

SELECT "performance_evaluations".* FROM "performance_evaluations"
---
    def index
      @evaluations = PerformanceEvaluation.all

SELECT "performance_evaluations".* FROM "performance_evaluations" WHERE "performance_evaluations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_evaluation
      @evaluation = PerformanceEvaluation.find(params[:id])